engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
#include "stm32f411xe.h"
#include "drivers/spi_internals.h"
#include "drivers/gpio.h"
#include "utils/common.h"
#include "drivers/spi.h"
#include "drivers/dma.h"
#include "utils/err.h"

#include <string.h>
#include <stddef.h>


// Mapping for the DMA streams to the SPI peripheral instances
static const dma_stream_map_t s_spi_i2s_dma_map[] = {
    // SPI1: DMA not supported: Not enough streams to go round other peripherals
    {
        .tx = {.stream = NULL, .channel = 0},
        .rx = {.stream = NULL, .channel = 0},
    },
    // SPI2
    {
        .tx = {.stream = DMA1_Stream4, .channel = 0},
        .rx = {.stream = DMA1_Stream3, .channel = 0},
    },
    // SPI3
    {
        .tx = {.stream = DMA1_Stream7, .channel = 0},
        .rx = {.stream = DMA1_Stream2, .channel = 0},
    },
    // SPI4
    {
        .tx = {.stream = DMA2_Stream1, .channel = 4},
        .rx = {.stream = DMA2_Stream4, .channel = 4},
    },
    // SPI5: DMA not supported: Not enough streams to go round other peripherals
    {
        .tx = {.stream = NULL, .channel = 0},
        .rx = {.stream = NULL, .channel = 0},
    },
};

// The SPI instances: The ISRs invoked when a DMA event occurred
static dma_stream_ctx_t s_dma_stream_ctx[ARRAY_SIZE(s_spi_i2s_dma_map)] = {};

// Helpers
[[__gnu__::__always_inline__]] static inline uint8_t get_index(const SPI_TypeDef* handle) {
    if (handle == SPI1) {
        return 0U;
    } else if (handle == SPI2) {
        return 1U;
    } else if (handle == SPI3) {
        return 2U;
    } else if (handle == SPI4) {
        return 3U;
    } else if (handle == SPI5) {
        return 4U;
    } else {
        return 0xFFU;
    }
}

[[__gnu__::__always_inline__]] static inline void isr_tx_helper(SPI_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    ASSERT(idx != 0xFFU);

    // Clear any flags that were set and get the error status
    hal_err_t ret = dma_isr_helper(s_spi_i2s_dma_map[idx].tx.stream);

    // Transfers require us to poll on the TXE and BSY flags even after data has
    // been shifted out. If they're not in the required state, an error occurred

    // Poll till TXE has been set
    // Skip polling if an error has occurred
    if (ret == HAL_OK) {
        uint32_t timeout = TIMEOUT_CYCLES;
        while (!(handle->SR & SPI_SR_TXE) && (--timeout));
        if (timeout == 0) {
            ret = HAL_ERR_SPI_TXE_FAILED_TO_SET;
        }
    }

    // Poll till BSY has been cleared
    // Skip polling BSY if TXE failed to set or another error occurred
    if (ret == HAL_OK) {
        uint32_t timeout = TIMEOUT_CYCLES;
        while ((handle->SR & SPI_SR_BSY) && (--timeout));
        if (timeout == 0) {
            ret = HAL_ERR_SPI_BSY_FAILED_TO_CLEAR;
        }
    }

    __disable_irq();

    // Save the user callback so we can clear it's global array position
    const dma_done_cb_t local_cb  = s_dma_stream_ctx[idx].tx.callback;
    void* const         local_arg = s_dma_stream_ctx[idx].tx.arg;

    // Only clear the user callback and disable the peripheral if not in circular mode
    if (!(s_spi_i2s_dma_map[idx].tx.stream->CR & DMA_SxCR_CIRC)) {
        s_dma_stream_ctx[idx].tx.callback = NULL;
        s_dma_stream_ctx[idx].tx.arg      = NULL;

        // Disable I2S as well since the interrupt could have been triggered by it
        DISABLE_SPI_DMA();
        DISABLE_SPI();
        DISABLE_I2S();
    }

    __enable_irq();

    if (local_cb) {
        // Finally, invoke the user callback
        local_cb(local_arg, ret);
    }
}

[[__gnu__::__always_inline__]] static inline void isr_rx_helper(SPI_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    ASSERT(idx != 0xFFU);

    // Clear any flags that were set and get the error status
    hal_err_t ret = dma_isr_helper(s_spi_i2s_dma_map[idx].rx.stream);

    __disable_irq();

    // Save the user callback so we can clear it's global array position
    const dma_done_cb_t local_cb  = s_dma_stream_ctx[idx].rx.callback;
    void* const         local_arg = s_dma_stream_ctx[idx].rx.arg;

    // Only clear the user callback and disable the peripheral if not in circular mode
    if (!(s_spi_i2s_dma_map[idx].rx.stream->CR & DMA_SxCR_CIRC)) {
        s_dma_stream_ctx[idx].rx.callback = NULL;
        s_dma_stream_ctx[idx].rx.arg      = NULL;

        // Disable I2S as well since the interrupt could have been triggered by it
        DISABLE_SPI_DMA();
        DISABLE_SPI();
        DISABLE_I2S();
    }

    __enable_irq();

    if (local_cb) {
        // Finally, invoke the user callback
        local_cb(local_arg, ret);
    }
}

[[__gnu__::__always_inline__]] static inline hal_err_t poll_transfer_helper(SPI_TypeDef* handle, const void* tx_data, void* rx_data, size_t size) {
    // The DFF bit being set means a 16 bit transfer
    if (handle->CR1 & SPI_CR1_DFF) {
        // Cast to appropriate type
        const uint16_t* tx_buf = (const uint16_t*)tx_data;
        uint16_t*       rx_buf = (uint16_t*)rx_data;

        for (size_t i = 0; i < size; i++) {
            // Write the data, or a dummy word if this is a receive-only transfer
            handle->DR = tx_buf ? tx_buf[i] : 0;

            // Poll till the data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

            // Poll till the data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

            // Read the data register: keep it if this is a receive, discard otherwise
            const uint16_t rx_word = (uint16_t)handle->DR;
            if (rx_buf) {
                rx_buf[i] = rx_word;
            }
        }

    } else {
        // Cast to appropriate type
        const uint8_t* tx_buf = (const uint8_t*)tx_data;
        uint8_t*       rx_buf = (uint8_t*)rx_data;

