engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
        for (size_t i = 0; i < size; i++) {
            // Write the data, or a dummy byte if this is a receive-only transfer
            handle->DR = tx_buf ? tx_buf[i] : 0;

            // Poll till data has been transferred out
            uint32_t timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_TXE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

            // Wait till data has been received
            timeout = TIMEOUT_CYCLES;
            while (!(handle->SR & SPI_SR_RXNE) && (--timeout));
            if (timeout == 0) {
                return HAL_ERR_TIMEOUT;
            }

            // Read the data register: keep it if this is a receive, discard otherwise
            const uint8_t rx_byte = (uint8_t)handle->DR;
            if (rx_buf) {
                rx_buf[i] = rx_byte;
            }
        }
    }

    // Wait for the TXE and BSY bits
    // TXE bit
    uint32_t timeout = TIMEOUT_CYCLES;
    while (!(handle->SR & SPI_SR_TXE) && (--timeout));
    if (timeout == 0) {
        return HAL_ERR_TIMEOUT;
    }

    // BSY bit
    timeout = TIMEOUT_CYCLES;
    while ((handle->SR & SPI_SR_BSY) && (--timeout));
    if (timeout == 0) {
        return HAL_ERR_TIMEOUT;
    }

    return HAL_OK;
}


// General API
hal_err_t spix_clk_enable(SPI_TypeDef* handle, bool enable) {
    if (enable) {
        if (handle == SPI1) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
        } else if (handle == SPI2) {
            RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
        } else if (handle == SPI3) {
            RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
        } else if (handle == SPI4) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI4EN;
        } else if (handle == SPI5) {
            RCC->APB2ENR |= RCC_APB2ENR_SPI5EN;
        } else {
            return HAL_ERR_INVALID_ARG;
        }

    } else {
        if (handle == SPI1) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI1EN;
        } else if (handle == SPI2) {
            RCC->APB1ENR &= ~RCC_APB1ENR_SPI2EN;
        } else if (handle == SPI3) {
            RCC->APB1ENR &= ~RCC_APB1ENR_SPI3EN;
        } else if (handle == SPI4) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI4EN;
        } else if (handle == SPI5) {
            RCC->APB2ENR &= ~RCC_APB2ENR_SPI5EN;
        } else {
            return HAL_ERR_INVALID_ARG;
        }
    }

    __DSB();
    return HAL_OK;
}

hal_err_t spi_master_init(SPI_TypeDef* handle, const spi_master_config_t* config) {
    if (handle == NULL || config == NULL || (!config->use_miso && !config->use_mosi)) {
        return HAL_ERR_INVALID_ARG;
    }

    // Disable the SPI (and I2S) peripheral before modifying it's internal state
    DISABLE_SPI();
    DISABLE_I2S();

    // Deselect I2S since in SPI mode
    handle->I2SCFGR &= ~SPI_I2SCFGR_I2SMOD;

    uint32_t cr1_mask = handle->CR1;
    cr1_mask &= ~(SPI_CR1_LSBFIRST | // MSB first
                  SPI_CR1_RXONLY |   // TX and RX
                  SPI_CR1_CRCEN |    // Hardware CRC disable
                  SPI_CR1_CRCNEXT |  // No CRC phase; data phase always
                  SPI_CR1_BIDIMODE | // MOSI and MISO used from the SPI peripheral's perspective
                  SPI_CR1_BIDIOE |   // Dual communication
                  // Clear remaining state
                  SPI_CR1_CPOL | SPI_CR1_CPHA | SPI_CR1_DFF | SPI_CR1_BR);

    cr1_mask |= (((uint32_t)config->prescaler << SPI_CR1_BR_Pos) | // Clock prescaler
                 SPI_CR1_SSM |                                     // Software slave select
                 SPI_CR1_SSI |                                     // Set internal slave to high
                 SPI_CR1_MSTR);                                    // SPI in master mode
    cr1_mask |= (config->cpol) ? SPI_CR1_CPOL : 0;
    cr1_mask |= (config->cpha) ? SPI_CR1_CPHA : 0;
    cr1_mask |= (config->data_size == SPI_DATA_16_BITS) ? SPI_CR1_DFF : 0;

    handle->CR1 = cr1_mask;

    // Motorolla mode and slave select output disable
    handle->CR2 &= ~(SPI_CR2_FRF | SPI_CR2_SSOE);

    // Configure the GPIO pins
    TRY(gpiox_clk_enable(config->sclk_pin.port, true));
    TRY(gpio_set_alternate_function(config->sclk_pin.port, config->sclk_pin.pin, config->sclk_pin.af));
    gpio_enable_pullup(config->sclk_pin.port, config->sclk_pin.pin, true);
    gpio_set_speed_mode(config->sclk_pin.port, config->sclk_pin.pin, GPIO_FULL_SPEED);
    gpio_set_output_type(config->sclk_pin.port, config->sclk_pin.pin, GPIO_PUSH_PULL);

    if (config->use_mosi) {
        TRY(gpiox_clk_enable(config->mosi_pin.port, true));
        TRY(gpio_set_alternate_function(config->mosi_pin.port, config->mosi_pin.pin, config->mosi_pin.af));
        gpio_enable_pullup(config->mosi_pin.port, config->mosi_pin.pin, true);
        gpio_set_speed_mode(config->mosi_pin.port, config->mosi_pin.pin, GPIO_FULL_SPEED);
        gpio_set_output_type(config->mosi_pin.port, config->mosi_pin.pin, GPIO_PUSH_PULL);
    }

    if (config->use_miso) {
        TRY(gpiox_clk_enable(config->miso_pin.port, true));
        TRY(gpio_set_alternate_function(config->miso_pin.port, config->miso_pin.pin, config->miso_pin.af));
        gpio_enable_pullup(config->miso_pin.port, config->miso_pin.pin, true);
        gpio_set_speed_mode(config->miso_pin.port, config->miso_pin.pin, GPIO_FULL_SPEED);
        gpio_set_output_type(config->miso_pin.port, config->miso_pin.pin, GPIO_OPEN_DRAIN);
    }

    return HAL_OK;
}

hal_err_t spi_master_deinit(SPI_TypeDef* handle) {
    if (handle == NULL) {
        return HAL_ERR_INVALID_ARG;
    }

    DISABLE_SPI();

    handle->CR1 &= ~(SPI_CR1_CPHA | SPI_CR1_CPOL | SPI_CR1_MSTR | SPI_CR1_BR | SPI_CR1_LSBFIRST | SPI_CR1_SSI | SPI_CR1_SSM | SPI_CR1_RXONLY |
                     SPI_CR1_DFF | SPI_CR1_CRCNEXT | SPI_CR1_CRCEN | SPI_CR1_BIDIOE | SPI_CR1_BIDIMODE);
    handle->CR2 &= ~(SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN | SPI_CR2_FRF | SPI_CR2_ERRIE | SPI_CR2_RXNEIE | SPI_CR2_TXEIE);

    return HAL_OK;
}

hal_err_t spi_master_dma_init(SPI_TypeDef* handle, dma_priority_t priority) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    DMA_Stream_TypeDef* tx_stream = s_spi_i2s_dma_map[idx].tx.stream;
    DMA_Stream_TypeDef* rx_stream = s_spi_i2s_dma_map[idx].rx.stream;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

