engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
    // The DFF bit being set means a 16 bit transfer
    const dma_data_size_t dma_data_size = (handle->CR1 & SPI_CR1_DFF) ? DMA_SIZE_HWORD : DMA_SIZE_BYTE;

    // DMA TX stream configuration
    const dma_stream_config_t tx_stream_config = {
        .deconfigure   = false,
        .enable_stream = false,

        .per_addr_incement = false,
        .mem_addr_incement = true,

        .tc_irq_enable  = true,
        .ht_irq_enable  = false,
        .te_irq_enable  = true,
        .dme_irq_enable = true,
        .fe_irq_enable  = false,

        .mode            = DMA_MODE_DIRECT,
        .priority        = priority,
        .direction       = DMA_DIR_M2P,
        .per_data_size   = dma_data_size,
        .mem_data_size   = dma_data_size,
        .circular_mode   = DMA_MODE_NO_CIRCULAR,
        .flow_controller = DMA_FLOW_CONTROLLER_DMA,

        .buffer_size       = 0,
        .channel           = s_spi_i2s_dma_map[idx].tx.channel,
        .nvic_irq_priority = SPI_DMA_NVIC_IRQ_PRIORITY,

        .per_addr  = NULL,
        .mem_buf_0 = NULL,
        .mem_buf_1 = NULL,
    };

    // DMA RX stream configuration
    const dma_stream_config_t rx_stream_config = {
        .deconfigure   = false,
        .enable_stream = false,

        .per_addr_incement = false,
        .mem_addr_incement = true,

        .tc_irq_enable  = true,
        .ht_irq_enable  = false,
        .te_irq_enable  = true,
        .dme_irq_enable = true,
        .fe_irq_enable  = false,

        .mode            = DMA_MODE_DIRECT,
        .priority        = priority,
        .direction       = DMA_DIR_P2M,
        .per_data_size   = dma_data_size,
        .mem_data_size   = dma_data_size,
        .circular_mode   = DMA_MODE_NO_CIRCULAR,
        .flow_controller = DMA_FLOW_CONTROLLER_DMA,

        .buffer_size       = 0,
        .channel           = s_spi_i2s_dma_map[idx].rx.channel,
        .nvic_irq_priority = SPI_DMA_NVIC_IRQ_PRIORITY,

        .per_addr  = NULL,
        .mem_buf_0 = NULL,
        .mem_buf_1 = NULL,
    };

    TRY(dma_configure_stream(tx_stream, &tx_stream_config));
    TRY(dma_configure_stream(rx_stream, &rx_stream_config));

    return HAL_OK;
}

hal_err_t spi_master_dma_deinit(SPI_TypeDef* handle) {
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU) {
        return HAL_ERR_INVALID_ARG;
    }

    DMA_Stream_TypeDef* tx_stream = s_spi_i2s_dma_map[idx].tx.stream;
    DMA_Stream_TypeDef* rx_stream = s_spi_i2s_dma_map[idx].rx.stream;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Set the deconfigure flags so dma_configure_stream(...) deinitializes the streams
    dma_stream_config_t tx_stream_config;
    tx_stream_config.deconfigure = true;

    dma_stream_config_t rx_stream_config;
    rx_stream_config.deconfigure = true;

    TRY(dma_configure_stream(tx_stream, &tx_stream_config));
    TRY(dma_configure_stream(rx_stream, &rx_stream_config));

    // Zero out all stored callbacks
    __disable_irq();
    memset(&s_dma_stream_ctx[idx], 0, sizeof(s_dma_stream_ctx[idx]));
    __enable_irq();

    return HAL_OK;
}


// Polling API
hal_err_t spi_master_transmit_poll(SPI_TypeDef* handle, const void* data, size_t size) {
    if (handle == NULL || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    ENABLE_SPI();
    const hal_err_t error = poll_transfer_helper(handle, data, NULL, size);
    DISABLE_SPI();

    return error;
}

hal_err_t spi_master_receive_poll(SPI_TypeDef* handle, void* data, size_t size) {
    if (handle == NULL || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    ENABLE_SPI();
    const hal_err_t error = poll_transfer_helper(handle, NULL, data, size);
    DISABLE_SPI();

    return error;
}

hal_err_t spi_master_transceive_poll(SPI_TypeDef* handle, const void* tx_data, void* rx_data, size_t size) {
    if (handle == NULL || tx_data == NULL || rx_data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    ENABLE_SPI();
    const hal_err_t error = poll_transfer_helper(handle, tx_data, rx_data, size);
    DISABLE_SPI();

    return error;
}


// DMA transfers API
hal_err_t spi_master_transmit_dma(SPI_TypeDef* handle, const void* data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX and RX mapping. The RX stream is used purely to drain the bytes SPI
    // shifts in during transmission: with RXDMAEN left enabled by
    // spi_master_dma_init(), an unserviced SPI RX side would leave the RXNE bit
    // set after the first byte and cause an overrun error.
    DMA_Stream_TypeDef* tx_stream = s_spi_i2s_dma_map[idx].tx.stream;
    DMA_Stream_TypeDef* rx_stream = s_spi_i2s_dma_map[idx].rx.stream;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Discard sink for whatever comes in on MISO. Never incremented, so
    // every incoming word overwrites the same throwaway location.
    static uint16_t s_dummy_rx;

    // Set the memory address and transaction length for the real TX data
    // Peripheral data side doesn't increment but memory side increments.
    dma_set_addresses(tx_stream, &handle->DR, data, NULL);
    dma_set_trans_length(tx_stream, size);
    dma_set_increment(tx_stream, false, true);

    // RX stream drains into the same throwaway word every beat:
    // Peripheral data side and memory side both do not get incremented.
    dma_set_addresses(rx_stream, &handle->DR, &s_dummy_rx, NULL);
    dma_set_trans_length(rx_stream, size);
    dma_set_increment(rx_stream, false, false);

    if (cb) {
        // Save the callback to the TX DMA irq only.
        // The isr_tx_helper(...) polls the BSY and TXE bit, which tells us
        // that the last bit of the data has been transmitted. Its only then
        // we can safely disable the SPI peripheral. isr_rx_helper(...) has
        // no such checks, so isr_tx_helper(...) is better for our usage here.
        __disable_irq();
        s_dma_stream_ctx[idx].tx.callback = cb;
        s_dma_stream_ctx[idx].tx.arg      = arg;
        __enable_irq();
    }

    TRY(dma_enable_stream(rx_stream));
    TRY_WITH_FUNC(dma_enable_stream(tx_stream), dma_disable_stream(rx_stream));

    ENABLE_SPI_DMA();
    ENABLE_SPI();

    return HAL_OK;
}

hal_err_t spi_master_receive_dma(SPI_TypeDef* handle, void* data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX and RX mapping. In master mode, SCLK is only generated while data is
    // shifted out of DR, so the TX stream is used to keep feeding a dummy
    // word in for the duration of the transfer.
    DMA_Stream_TypeDef* tx_stream = s_spi_i2s_dma_map[idx].tx.stream;
    DMA_Stream_TypeDef* rx_stream = s_spi_i2s_dma_map[idx].rx.stream;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

    // Dummy source fed to DR for the duration of the transfer, purely to generate
    // the clock. Never incremented, so the same zero word is read every beat.
    static const uint16_t s_dummy_tx = 0;

    // TX stream feeds the same dummy word every beat: peripheral and
    // memory side both fixed, nothing to increment
    dma_set_addresses(tx_stream, &handle->DR, &s_dummy_tx, NULL);
    dma_set_trans_length(tx_stream, size);
    dma_set_increment(tx_stream, false, false);

    // Set the memory address and transaction length for the real RX data
    dma_set_addresses(rx_stream, &handle->DR, data, NULL);
    dma_set_trans_length(rx_stream, size);
    dma_set_increment(rx_stream, false, true);

    if (cb) {
        // Save the callback to the TX DMA irq only.
        // The isr_tx_helper(...) polls the BSY and TXE bit, which tells us
        // that the last bit of the data has been transmitted. Its only then
        // we can safely disable the SPI peripheral. isr_rx_helper(...) has
        // no such checks, so isr_tx_helper(...) is better for our usage here.
        __disable_irq();
        s_dma_stream_ctx[idx].tx.callback = cb;
        s_dma_stream_ctx[idx].tx.arg      = arg;
        __enable_irq();
    }

    TRY(dma_enable_stream(rx_stream));
    TRY_WITH_FUNC(dma_enable_stream(tx_stream), dma_disable_stream(rx_stream));

    ENABLE_SPI_DMA();
    ENABLE_SPI();

    return HAL_OK;
}

hal_err_t spi_master_transceive_dma(SPI_TypeDef* handle, const void* tx_data, void* rx_data, uint16_t size, dma_done_cb_t cb, void* arg) {
    // Get index for DMA stream mapping
    const uint8_t idx = get_index(handle);
    if (idx == 0xFFU || tx_data == NULL || rx_data == NULL || size == 0) {
        return HAL_ERR_INVALID_ARG;
    }

    // TX and RX mapping
    DMA_Stream_TypeDef* tx_stream = s_spi_i2s_dma_map[idx].tx.stream;
    DMA_Stream_TypeDef* rx_stream = s_spi_i2s_dma_map[idx].rx.stream;

    if (tx_stream == NULL || rx_stream == NULL) {
        return HAL_ERR_NOT_SUPPORTED;
    }

