engineer-ae3o/stm32-hal-library/components/drivers/src/spi.c
    // Set the memory address and transaction length.
    // Re-enable memory increment for both streams.
    dma_set_addresses(tx_stream, &handle->DR, tx_data, NULL);
    dma_set_trans_length(tx_stream, size);
    dma_set_increment(tx_stream, false, true);

    dma_set_addresses(rx_stream, &handle->DR, rx_data, NULL);
    dma_set_trans_length(rx_stream, size);
    dma_set_increment(rx_stream, false, true);

    if (cb) {
        // Save the callback to the TX DMA irq only.
        // The isr_tx_helper(...) polls the BSY and TXE bit, which tells us
        // that the last bit of the data has been transmitted. Its only then
        // we can safely disable the SPI peripheral. isr_rx_helper(...) has
        // no such checks, so isr_tx_helper(...) is better for our usage here.
        __disable_irq();
        s_dma_stream_ctx[idx].tx.callback = cb;
        s_dma_stream_ctx[idx].tx.arg      = arg;
        __enable_irq();
    }

    TRY(dma_enable_stream(rx_stream));
    TRY_WITH_FUNC(dma_enable_stream(tx_stream), dma_disable_stream(rx_stream));

    ENABLE_SPI_DMA();
    ENABLE_SPI();

    return HAL_OK;
}


// To be used only by i2s.c to register interrupt handlers and get its DMA stream(s)
hal_err_t spi_master_register_callback(dma_done_cb_t callback, void* arg, uint8_t idx, bool is_tx) {
    if (callback == NULL || idx >= ARRAY_SIZE(s_spi_i2s_dma_map)) {
        return HAL_ERR_INVALID_ARG;
    }
    __disable_irq();
    if (is_tx) {
        s_dma_stream_ctx[idx].tx.callback = callback;
        s_dma_stream_ctx[idx].tx.arg      = arg;
    } else {
        s_dma_stream_ctx[idx].rx.callback = callback;
        s_dma_stream_ctx[idx].rx.arg      = arg;
    }
    __enable_irq();
    return HAL_OK;
}

hal_err_t spi_master_get_dma_stream_map(dma_stream_map_t* map, uint32_t idx) {
    if (map == NULL || idx >= ARRAY_SIZE(s_spi_i2s_dma_map)) {
        return HAL_ERR_INVALID_ARG;
    }
    *map = s_spi_i2s_dma_map[idx];
    return HAL_OK;
}


// DMA interrupts
// SPI2: TX
void DMA1_Stream4_IRQHandler(void) {
    isr_tx_helper(SPI2);
}

// SPI2: RX
void DMA1_Stream3_IRQHandler(void) {
    isr_rx_helper(SPI2);
}

// SPI3: TX
void DMA1_Stream7_IRQHandler(void) {
    isr_tx_helper(SPI3);
}

// SPI3: RX
void DMA1_Stream2_IRQHandler(void) {
    isr_rx_helper(SPI3);
}

// SPI4: TX
void DMA2_Stream1_IRQHandler(void) {
    isr_tx_helper(SPI4);
}

// SPI4: RX
void DMA2_Stream4_IRQHandler(void) {
    isr_rx_helper(SPI4);
}
